In [1]:
from sqlalchemy import create_engine, text
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
database_name = 'scooters'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [4]:
query = '''
SELECT *
FROM scooters
LIMIT 100
'''
with engine.connect() as connection:
    result = connection.execute(text(query))

In [5]:
with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-06-28 22:00:43,36.1200,-86.7532,Powered0e8ab45b-9137-52d3-b19c-a4cfdc346a69,Powered,56.0,scooter,0.06,Jump
1,2019-06-28 22:00:43,36.1197,-86.7534,Poweredb8d073b6-d292-5d64-b8cc-304815bafef0,Powered,3.0,scooter,0.06,Jump
2,2019-06-28 22:00:43,36.1200,-86.7533,Poweredf0e72326-77bb-5609-b550-f619a28e58f0,Powered,1.0,scooter,0.06,Jump
3,2019-06-28 22:00:43,36.1427,-86.7873,Powered3c4881f0-fc84-5556-aebf-7b00ec2786fe,Powered,0.0,scooter,0.06,Jump
4,2019-06-28 22:00:43,36.1644,-86.7770,Powered4d7d8e28-fd03-59a7-9d30-494f70b56422,Powered,74.0,scooter,0.06,Jump

In [6]:
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
 1   latitude     100 non-null    float64
 2   longitude    100 non-null    float64
 3   sumdid       100 non-null    object
 4   sumdtype     100 non-null    object
 5   chargelevel  100 non-null    float64
 6   sumdgroup    100 non-null    object
 7   costpermin   100 non-null    float64
 8   companyname  100 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 7.2+ KB

In [7]:
query = '''
SELECT companyname, Count(*)
FROM scooters 
group by companyname;
'''
counts = pd.read_sql_query(query, engine)
counts

  companyname     count
0        Bird  12251590
1        Bolt   3477198
2      Gotcha   4679280
3        Jump  21835098
4        Lime  16524261
5        Lyft   9087043
6        Spin   5559573

In [8]:
TRIP = '''
SELECT *
FROM TRIPS 
LIMIT 100
'''
TRIPSVAL = pd.read_sql_query(TRIP, engine)
TRIPSVAL.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-06-15 19:46:48.883,Bird,BRD3504,PoweredXD7KC,10.0,0.000,2019-06-15,19:37:45.386666,2019-06-15,19:48:09.156666,36.1495,-86.8024,36.1601,-86.7792,"[(36.149427, -86.802383), (36.149345, -86.8025...",2019-06-16 05:31:58.843
1,2019-06-15 19:46:48.883,Bird,BRD3512,PoweredQYRHN,24.0,4265.092,2019-06-15,19:23:43.176666,2019-06-15,19:47:47.300000,36.1669,-86.7857,36.1707,-86.7858,"[(36.166969, -86.78565), (36.166971, -86.78565...",2019-06-16 05:31:59.093
2,2019-06-15 19:46:48.883,Bird,BRD3506,PoweredDGXH7,13.0,0.000,2019-06-15,19:35:41.303333,2019-06-15,19:48:16.276666,36.1785,-86.7500,36.1745,-86.7424,"[(36.178616, -86.749981), (36.178535, -86.7500...",2019-06-16 05:31:58.907
3,2019-06-15 19:46:48.883,Bird,BRD3513,Powered142KL,26.0,2952.756,2019-06-15,19:21:51.673333,2019-06-15,19:47:25.356666,36.1377,-86.8010,36.1472,-86.8006,"[(36.137728, -86.800923), (36.137755, -86.8008...",2019-06-16 05:31:59.127
4,2019-06-15 19:46:48.883,Bird,BRD3517,Powered4JJJC,66.0,20341.208,2019-06-15,18:43:00.646666,2019-06-15,19:48:36.640000,36.1535,-86.7859,36.1581,-86.7774,"[(36.153279, -86.785852), (36.154302, -86.7860...",2019-06-16 05:31:59.250

In [9]:
SUMIDS = '''
SELECT SUMDID
FROM trips
GROUP BY SUMDID
ORDER BY SUMDID
'''
SUMIDSTRIP = pd.read_sql_query(SUMIDS, engine)
SUMIDSTRIP

                                            sumdid
0     Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619
1     Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d
2     Powered-03be23ca-d43b-222f-be54-e44b5b4690df
3     Powered-046201fb-6532-1f37-6334-3612fb1e61f7
4     Powered-0479bb84-afbd-0426-f1c4-df628542a88c
...                                            ...
9000                                  PoweredZZFGD
9001                          PoweredZZNTWU4QI7MLI
9002                          PoweredZZQ7FMUUD6ULV
9003                          PoweredZZQOO54WD4AJT
9004                         StandardLIRPOZ7X3ZVGO

[9005 rows x 1 columns]

In [10]:
MINLATLON = '''
SELECT 'SCOOTER'TABLE_NAME,MIN(latitude) MIN_LAT,MAX(latitude) MAX_LAT,MIN(longitude) MIN_LON, MAX(longitude) MAX_LON 
FROM scooters 
UNION 
SELECT 'TRIPS'TABLE_NAME, MIN(startlatitude) MIN_LAT,MAX(endlatitude) MAX_LAT,MIN(endlongitude) MIN_LON, MAX(endlongitude) MAX_LON 
FROM trips 
'''
LATLON = pd.read_sql_query(MINLATLON, engine)
LATLON

  table_name  min_lat       max_lat     min_lon     max_lon
0    SCOOTER   0.0000  3.609874e+06  -97.443879    0.000000
1      TRIPS  35.8532  5.104541e+01 -122.673729  174.764886

In [11]:
SUMGRP ='''
SELECT SUMDGROUP
FROM scooters 
GROUP BY SUMDGROUP
'''

GROUPTYPE = pd.read_sql_query(SUMGRP, engine)
GROUPTYPE

  sumdgroup
0   bicycle
1   scooter
2   Scooter

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

1A. How many scooters did each company have in this time frame

In [12]:
TOTALSCOOTERS = '''
SELECT COMPANYNAME,
COUNT(DISTINCT(SUMDID)) COUNTS
FROM scooters TABLESAMPLE SYSTEM (1)
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
COMPANYNAME
'''
SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)
SCOOTERCOUNT

  companyname  counts
0        Bird    3774
1        Bolt     356
2      Gotcha     224
3        Jump    1210
4        Lime    1791
5        Lyft    1709
6        Spin     791

In [13]:
1B. Did the number for each company change over time?

In [14]:
JUSTSCOOTERS1 = '''
SELECT 
UPPER(SUMDGROUP) SUMDGROUP,
UPPER(COMPANYNAME) COMPANYNAME,
TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,
TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,
TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,
COUNT(DISTINCT(SUMDID))
FROM SCOOTERS TABLESAMPLE SYSTEM (1)
WHERE 
UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
ORDER BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
'''

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , engine)
SCOOTERSONLY1

   sumdgroup companyname month_num month_name year_val  count
0    SCOOTER        BIRD        05  MAY           2019   2947
1    SCOOTER        BIRD        06  JUNE          2019   2825
2    SCOOTER        BIRD        07  JULY          2019   2463
3    SCOOTER        BOLT        05  MAY           2019    344
4    SCOOTER        BOLT        06  JUNE          2019    330
5    SCOOTER        BOLT        07  JULY          2019    271
6    SCOOTER      GOTCHA        05  MAY           2019    223
7    SCOOTER      GOTCHA        06  JUNE          2019    223
8    SCOOTER      GOTCHA        07  JULY          2019    224
9    SCOOTER        JUMP        05  MAY           2019    976
10   SCOOTER        JUMP        06  JUNE          2019   1036
11   SCOOTER        JUMP        07  JULY          2019   1206
12   SCOOTER        LIME        05  MAY           2019   1609
13   SCOOTER        LIME        06  JUNE          2019   1433
14   SCOOTER        LIME        07  JULY          2019    872
15   SCOOTER        LYFT        05  MAY           2019   1349
16   SCOOTER        LYFT        06  JUNE          2019   1123
17   SCOOTER        LYFT        07  JULY          2019   1017
18   SCOOTER        SPIN        05  MAY           2019    669
19   SCOOTER        SPIN        06  JUNE          2019    702
20   SCOOTER        SPIN        07  JULY          2019    544

1C. Did scooter usage vary by company?

In [15]:
TRIPSTESTSPEED ='''
SELECT *
FROM TRIPS TABLESAMPLE SYSTEM (1)
'''
SPEEDTESTTRIP= pd.read_sql_query(TRIPSTESTSPEED , engine)
SPEEDTESTTRIP

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 19:12:48.817,Lyft,LFT814,Powered776703,12.183233,10875.98460,2019-05-01,19:00:37.696666,2019-05-01,19:12:48.690000,36.151240,-86.779370,36.151390,-86.779350,"[(36.15124, -86.77937), (36.15134, -86.77937),...",2019-05-02 07:21:22.683
1,2019-05-01 19:13:46.157,Lyft,LFT815,Powered680595,3.484650,1105.64308,2019-05-01,19:10:16.980000,2019-05-01,19:13:46.056666,36.163520,-86.776120,36.163570,-86.779100,"[(36.16352, -86.77612), (36.16342, -86.77629),...",2019-05-02 07:21:22.713
2,2019-05-01 19:14:19.547,Lyft,LFT816,Powered369799,19.349183,15150.91912,2019-05-01,18:54:58.456666,2019-05-01,19:14:19.406666,36.131080,-86.770080,36.147700,-86.799230,"[(36.13108, -86.77008), (36.1311, -86.77001), ...",2019-05-02 07:21:22.743
3,2019-05-01 19:16:47.060,Bird,BRD969,Powered1PDIE,4.000000,921.91604,2019-05-01,19:13:19.526666,2019-05-01,19:17:25.376666,36.162700,-86.781300,36.163900,-86.778400,"[(36.16283, -86.781189), (36.162818, -86.78120...",2019-05-02 05:31:14.067
4,2019-05-01 19:16:47.060,Bird,BRD972,PoweredU6WYW,12.000000,4593.17600,2019-05-01,19:06:37.586666,2019-05-01,19:18:26.520000,36.155400,-86.785400,36.159400,-86.781000,"[(36.155531, -86.785234), (36.157839, -86.7867...",2019-05-02 05:31:14.163
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5388,2019-07-31 23:13:29.273,Lyft,LFT737,Powered345929,61.905717,40390.42124,2019-07-31,22:11:34.803333,2019-07-31,23:13:29.146666,36.159520,-86.781110,36.153260,-86.688410,"[(36.15952, -86.78111), (36.15944, -86.78112),...",2019-08-01 10:35:34.280
5389,2019-07-31 23:13:44.883,Lyft,LFT738,Powered659942,5.243067,2956.03684,2019-07-31,23:08:30.166666,2019-07-31,23:13:44.750000,36.150000,-86.810990,36.152760,-86.804640,"[(36.15, -86.81099), (36.15004, -86.81081), (3...",2019-08-01 10:35:34.313
5390,2019-07-31 23:14:05.527,Lyft,LFT739,Powered211694,46.653900,11771.65392,2019-07-31,22:27:26.153333,2019-07-31,23:14:05.386666,36.166200,-86.781250,36.153830,-86.784040,"[(36.1662, -86.78125), (36.16614, -86.78124), ...",2019-08-01 10:35:34.343
5391,2019-07-31 23:14:08.297,SPIN,SPI188,Powered2870006,5.000000,869.42260,2019-07-31,23:05:30,2019-07-31,23:09:40,36.147500,-86.810989,36.147224,-86.813920,"[(36.14722359865786, -86.8139199016669), (36.1...",2019-08-01 11:36:29.393
5392,2019-07-31 23:14:08.297,SPIN,SPI181,Powered5745988,19.000000,3287.40168,2019-07-31,22:55:39,2019-07-31,23:14:02,36.148934,-86.806922,36.146184,-86.796297,"[(36.14618402909129, -86.7962973006878), (36.1...",2019-08-01 11:36:29.423

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours

In [16]:
TRIPSCOOTER = '''
SELECT 'OVER 24 HRS' STATUS, UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
GROUP BY companyname
UNION
SELECT 'UNDER 1 MINUTE' STATUS, UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1
GROUP BY companyname
ORDER BY status DESC,companyname
'''
scooterstriptime= pd.read_sql_query(TRIPSCOOTER, engine)
scooterstriptime

           status    companyname
0  UNDER 1 MINUTE           BIRD
1  UNDER 1 MINUTE           LIME
2  UNDER 1 MINUTE           LYFT
3     OVER 24 HRS  BOLT MOBILITY
4     OVER 24 HRS           LYFT
5     OVER 24 HRS           SPIN

Are the scooter companies in compliance with the second and third part of this rule?

In [17]:
COMPLIANCE ='''
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS WHERE  UPPER(companyname) NOT IN 
(SELECT  COMPANYNAME FROM
(
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
UNION
SELECT 
UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1) 
GROUP BY COMPANYNAME)
GROUP BY
UPPER(companyname) 
'''
COMPLIANT= pd.read_sql_query(COMPLIANCE, engine)
COMPLIANT

  companyname
0      GOTCHA
1        JUMP

In [18]:
SCOOTERUSAGE = '''
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNT
FROM
TRIPS T TABLESAMPLE SYSTEM (1) 
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS TABLESAMPLE SYSTEM (1) WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) >1
ORDER BY STARTDATE,UPPER(COMPANYNAME)
'''
USE = pd.read_sql_query(SCOOTERUSAGE, engine)
USE

    companyname   startdate                sumdid  count
0          LIME  2019-05-01  PoweredRYBS56AVNJ675      2
1          LIME  2019-05-01  PoweredZZQ7FMUUD6ULV      2
2          LIME  2019-05-02  PoweredAUEC3ZVEBFFUU      2
3          BIRD  2019-05-03          PoweredVWW35      2
4          BIRD  2019-05-04          PoweredVV81G      2
..          ...         ...                   ...    ...
111        LIME  2019-07-20  PoweredQJ4AYR4HCIOVR      2
112        LIME  2019-07-28  PoweredN4X5DADBR7CVF      2
113        BIRD  2019-07-29          PoweredESM86      2
114        BIRD  2019-07-29          PoweredM6LIQ      2
115        BIRD  2019-07-29          PoweredURAYV      2

[116 rows x 4 columns]

In [19]:
min_day = USE["startdate"].min()
max_day = USE["startdate"].max()

In [20]:
USES = USE["count"].sum()
print(USES)

241

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

Based on the data, what is the average number of trips per scooter per day?

In [21]:
SCOOTERUSAGEAVG = '''
WITH X AS (
SELECT
MAX(STARTDATE)-MIN(STARTDATE) TOTALDAYS,
COUNT(DISTINCT(SUMDID)) TOTALSCOOTERS,
COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)) SCOOTERTOTALDAYS,
SUM(COUNTRECNUM) TOTALUSES,
SUM(COUNTRECNUM)/(COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE))) AVG_USE_DAY
FROM(
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNTRECNUM
FROM
TRIPS T
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) > 1
ORDER BY STARTDATE,UPPER(COMPANYNAME)))
SELECT * FROM X
'''
USESCOOTER = pd.read_sql_query(SCOOTERUSAGEAVG, engine)
AVGSCOOTERUSE = USESCOOTER["avg_use_day"]
print(f" Avg use days: {AVGSCOOTERUSE}")

 Avg use days: 0    0.594888
Name: avg_use_day, dtype: float64

 How does this vary by company?

In [28]:
SCOOTERUSAGEAVGCOM = '''
WITH X AS (
SELECT
COMPANYNAME,
MAX(STARTDATE)-MIN(STARTDATE) TOTALDAYS,
COUNT(DISTINCT(SUMDID)) TOTALSCOOTERS,
COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)) SCOOTERTOTALDAYS,
SUM(COUNTRECNUM) TOTALUSES,
CASE WHEN SUM(COUNTRECNUM) = 0 THEN 0 ELSE
SUM(COUNTRECNUM)/(COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)))
END AVG_USE_DAY
FROM(
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNTRECNUM
FROM
TRIPS T
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) > 1
ORDER BY STARTDATE,UPPER(COMPANYNAME))
GROUP BY COMPANYNAME
)
SELECT COMPANYNAME, round(AVG_USE_DAY,2) AVG_USE_DAY FROM X 
'''
USESCOOTERCOM = pd.read_sql_query(SCOOTERUSAGEAVGCOM, engine)
USESCOOTERCOM

     companyname  avg_use_day
0           BIRD         0.32
1  BOLT MOBILITY         0.48
2         GOTCHA         0.24
3           JUMP         0.17
4           LIME         1.35
5           LYFT         0.69
6           SPIN         0.48

5. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd.